Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_rfd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/dmt.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief DMT register API structure */
typedef struct
{  /* Dead Man Timer */
  __IO  uint32_t                       DMT_DMTCON;         /**< Offset: 0x00 (R/W  32)  */
  __IO  uint32_t                       DMT_DMTCONCLR;      /**< Offset: 0x04 (R/W  32) Bit clear register */
  __IO  uint32_t                       DMT_DMTCONSET;      /**< Offset: 0x08 (R/W  32) Bit set register */
  __IO  uint32_t                       DMT_DMTCONINV;      /**< Offset: 0x0C (R/W  32) Bit invert register */
  __IO  uint32_t                       DMT_DMTPRECLR;      /**< Offset: 0x10 (R/W  32)  */
  __IO  uint32_t                       DMT_DMTPRECLRCLR;   /**< Offset: 0x14 (R/W  32) Bit clear register */
  __IO  uint32_t                       DMT_DMTPRECLRSET;   /**< Offset: 0x18 (R/W  32) Bit set register */
  __IO  uint32_t                       DMT_DMTPRECLRINV;   /**< Offset: 0x1C (R/W  32) Bit invert register */
  __IO  uint32_t                       DMT_DMTCLR;         /**< Offset: 0x20 (R/W  32)  */
  __IO  uint32_t                       DMT_DMTCLRCLR;      /**< Offset: 0x24 (R/W  32) Bit clear register */
  __IO  uint32_t                       DMT_DMTCLRSET;      /**< Offset: 0x28 (R/W  32) Bit set register */
  __IO  uint32_t                       DMT_DMTCLRINV;      /**< Offset: 0x2C (R/W  32) Bit invert register */
  __IO  uint32_t                       DMT_DMTSTAT;        /**< Offset: 0x30 (R/W  32)  */
  __IO  uint32_t                       DMT_DMTSTATCLR;     /**< Offset: 0x34 (R/W  32) Bit clear register */
  __IO  uint32_t                       DMT_DMTSTATSET;     /**< Offset: 0x38 (R/W  32) Bit set register */
  __IO  uint32_t                       DMT_DMTSTATINV;     /**< Offset: 0x3C (R/W  32) Bit invert register */
  __IO  uint32_t                       DMT_DMTCNT;         /**< Offset: 0x40 (R/W  32)  */
  __IO  uint32_t                       DMT_DMTCNTCLR;      /**< Offset: 0x44 (R/W  32) Bit clear register */
  __IO  uint32_t                       DMT_DMTCNTSET;      /**< Offset: 0x48 (R/W  32) Bit set register */
  __IO  uint32_t                       DMT_DMTCNTINV;      /**< Offset: 0x4C (R/W  32) Bit invert register */
  __IO  uint32_t                       DMT_DMTHOLDREG;     /**< Offset: 0x50 (R/W  32)  */
  __IO  uint32_t                       DMT_DMTHOLDREGCLR;  /**< Offset: 0x54 (R/W  32) Bit clear register */
  __IO  uint32_t                       DMT_DMTHOLDREGSET;  /**< Offset: 0x58 (R/W  32) Bit set register */
  __IO  uint32_t                       DMT_DMTHOLDREGINV;  /**< Offset: 0x5C (R/W  32) Bit invert register */
  __IO  uint32_t                       DMT_DMTPSCNT;       /**< Offset: 0x60 (R/W  32)  */
  __IO  uint32_t                       DMT_DMTPSCNTCLR;    /**< Offset: 0x64 (R/W  32) Bit clear register */
  __IO  uint32_t                       DMT_DMTPSCNTSET;    /**< Offset: 0x68 (R/W  32) Bit set register */
  __IO  uint32_t                       DMT_DMTPSCNTINV;    /**< Offset: 0x6C (R/W  32) Bit invert register */
  __IO  uint32_t                       DMT_DMTPSINTV;      /**< Offset: 0x70 (R/W  32)  */
  __IO  uint32_t                       DMT_DMTPSINTVCLR;   /**< Offset: 0x74 (R/W  32) Bit clear register */
  __IO  uint32_t                       DMT_DMTPSINTVSET;   /**< Offset: 0x78 (R/W  32) Bit set register */
  __IO  uint32_t                       DMT_DMTPSINTVINV;   /**< Offset: 0x7C (R/W  32) Bit invert register */
} dmt_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _BZ25_DMT_COMPONENT_H_ */
